# Project Title
---

Group Name

Team members:
- Name
- Name
- Name

## Introduction 
__Introduction to the topic__ 

    ...

---

## Problem Statement

    ...

## Objectives:
__Questions that will guide the analysis to solve the problem__

    ...

---

## Exploratory Data Analysis (EDA):

### Data Info:
__Getting the data and exploring it (includes descriptive statistics)__

In [208]:
import pandas as pd

# Plotting libraries
import matplotlib.pyplot as plt
import seaborn as sns

# Interactive visualization library
import plotly.express as px
import plotly.graph_objects as go
from plotly.subplots import make_subplots

# N-D arrays & vectorized math
import numpy as np

In [209]:
athlets_events_df=pd.read_csv('olympics/athlete_events.csv')
                              
noc_regions_df= pd.read_csv('olympics/noc_regions.csv')

In [210]:
athlets_events_df.describe()

                  ID            Age
count  271116.000000  261642.000000
mean    68248.954396      25.556898
std     39022.286345       6.393561
min         1.000000      10.000000
25%     34643.000000      21.000000
50%     68205.000000      24.000000
75%    102097.250000      28.000000
max    135571.000000      97.000000

In [211]:

athlets_events_df.dtypes

ID          int64
Name       object
Sex        object
Age       float64
Height     object
Weight     object
Team       object
NOC        object
Games      object
City       object
Sport      object
Event      object
Medal      object
dtype: object

In [212]:
noc_regions_df.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [213]:
print(athlets_events_df.shape)

print(athlets_events_df.isnull().sum())
athlets_events_df.isnull().mean()*100

(271116, 13)
ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight     62875
Team           0
NOC            0
Games          0
City           0
Sport          0
Event          0
Medal     231333
dtype: int64

ID         0.000000
Name       0.000000
Sex        0.000000
Age        3.494445
Height    22.193821
Weight    23.191180
Team       0.000000
NOC        0.000000
Games      0.000000
City       0.000000
Sport      0.000000
Event      0.000000
Medal     85.326207
dtype: float64

### Data Handling: 
__Cleaning, transforming, and combining data__

In [214]:
athlets_events_clean=athlets_events_df
athlets_events_clean.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,City,Sport,Event,Medal
0,1,A Dijiang,male,24.0,180.0cm,80.0kg,China,CHN,1992 Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,Male,23.0,170.0cm,60.0kg,China,CHN,2012 Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,Male,24.0,NaN,NaN,Denmark,DEN,1920 Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,FeMale,21.0,185.0cm,82.0kg,Netherlands,NED,1988 Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [215]:
athlets_events_clean['Height']=athlets_events_clean['Height'].str.replace('cm','').astype(float)

athlets_events_clean['Weight']=athlets_events_clean['Weight'].str.replace('kg','').astype(float)

In [216]:
athlets_events_clean.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,City,Sport,Event,Medal
0,1,A Dijiang,male,24.0,180.0,80.0,China,CHN,1992 Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,Male,23.0,170.0,60.0,China,CHN,2012 Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,Male,24.0,NaN,NaN,Denmark,DEN,1920 Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,FeMale,21.0,185.0,82.0,Netherlands,NED,1988 Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [217]:
athlets_events_clean

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,City,Sport,Event,Medal
0,1,A Dijiang,male,24.0,180.0,80.0,China,CHN,1992 Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,Male,23.0,170.0,60.0,China,CHN,2012 Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,Male,24.0,NaN,NaN,Denmark,DEN,1920 Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,FeMale,21.0,185.0,82.0,Netherlands,NED,1988 Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
271111,135569,Andrzej ya,M,29.0,179.0,89.0,Poland-1,POL,1976 Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NaN
271112,135570,Piotr ya,male,27.0,176.0,59.0,Poland,POL,2014 Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NaN
271113,135570,Piotr ya,Male,27.0,176.0,59.0,Poland,POL,2014 Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NaN
271114,135571,Tomasz Ireneusz ya,male,30.0,185.0,96.0,Poland,POL,1998 Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN
271115,135571,Tomasz Ireneusz ya,Male,34.0,185.0,96.0,Poland,POL,2002 Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NaN

In [218]:
print(athlets_events_df['Weight'].mean())

weight_grouping=athlets_events_df.groupby('NOC')['Weight'].mean()

weight_grouping

70.70239290053351

NOC
AFG    65.901639
AHO    76.176471
ALB    71.491803
ALG    68.693252
AND    70.644444
         ...
YEM    59.680000
YMD    63.333333
YUG    75.156326
ZAM    66.035971
ZIM    68.159170
Name: Weight, Length: 230, dtype: float64

In [219]:
athlets_events_clean.dtypes

athlets_events_clean.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,City,Sport,Event,Medal
0,1,A Dijiang,male,24.0,180.0,80.0,China,CHN,1992 Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,Male,23.0,170.0,60.0,China,CHN,2012 Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,Male,24.0,NaN,NaN,Denmark,DEN,1920 Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,FeMale,21.0,185.0,82.0,Netherlands,NED,1988 Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [220]:
athlets_events_clean.dropna(subset=["Age"],inplace=True)

# athlets_events_clean.drop(columns=["Medal"], inplace=True)

athlets_events_clean.shape


athlets_events_clean['Height'].fillna(athlets_events_df['Height'].mean(),inplace=True)

athlets_events_clean['Weight'].fillna(athlets_events_df['Weight'].mean(),inplace=True)

athlets_events_clean.isnull().sum()

C:\Users\yaqee\AppData\Local\Temp\ipykernel_29816\512720568.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  athlets_events_clean['Height'].fillna(athlets_events_df['Height'].mean(),inplace=True)
C:\Users\yaqee\AppData\Local\Temp\ipykernel_29816\512720568.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  athlets_events_clean['Weight'].fillna(athlets_events_df['Weight'].mean(),inplace=True)

ID             0
Name           0
Sex            0
Age            0
Height         0
Weight         0
Team           0
NOC            0
Games          0
City           0
Sport          0
Event          0
Medal     222591
dtype: int64

In [ ]:
#fixing the sex col:
for i, val in athlets_events_clean['Sex'].items():
    val = str(val).lower()
    if val in ['male', 'm']:
        athlets_events_clean.at[i, 'Sex'] = 'Male'
    elif val in ['female', 'f']:
        athlets_events_clean.at[i, 'Sex'] = 'Female'

In [ ]:
athlets_events_clean['Sex'].unique()

#FIXED

array(['Male', 'Female'], dtype=object)

In [223]:
print(athlets_events_clean.isnull().sum())

ID             0
Name           0
Sex            0
Age            0
Height         0
Weight         0
Team           0
NOC            0
Games          0
City           0
Sport          0
Event          0
Medal     222591
dtype: int64

In [224]:
athlets_events_clean.dtypes

ID          int64
Name       object
Sex        object
Age       float64
Height    float64
Weight    float64
Team       object
NOC        object
Games      object
City       object
Sport      object
Event      object
Medal      object
dtype: object

In [225]:
athlets_events_clean.duplicated().sum()

athlets_events_clean.drop_duplicates(inplace=True)

In [226]:
athlets_events_clean.shape

(260416, 13)

In [227]:
noc_regions_df.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [228]:
noc_regions_df.isnull().sum()

noc_regions_clean= noc_regions_df

In [229]:
noc_regions_clean.isnull().sum()

NOC         0
region      3
notes     209
dtype: int64

In [230]:
noc_regions_clean.drop(columns=["notes"], inplace=True)

In [231]:
noc_regions_clean = noc_regions_clean.dropna(subset=["region"]).copy()

In [232]:
noc_regions_clean.isnull().sum()

noc_regions_clean

     NOC       region
0    AFG  Afghanistan
1    AHO      Curacao
2    ALB      Albania
3    ALG      Algeria
4    AND      Andorra
..   ...          ...
225  YEM        Yemen
226  YMD        Yemen
227  YUG       Serbia
228  ZAM       Zambia
229  ZIM     Zimbabwe

[227 rows x 2 columns]

In [233]:
athlets_events_clean.isna().sum()

ID             0
Name           0
Sex            0
Age            0
Height         0
Weight         0
Team           0
NOC            0
Games          0
City           0
Sport          0
Event          0
Medal     221372
dtype: int64

In [234]:
athlets_events_clean.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,City,Sport,Event,Medal
0,1,A Dijiang,Male,24.0,180.000000,80.000000,China,CHN,1992 Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,Male,23.0,170.000000,60.000000,China,CHN,2012 Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,Male,24.0,175.351367,70.712603,Denmark,DEN,1920 Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,Male,34.0,175.351367,70.712603,Denmark/Sweden,DEN,1900 Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,Female,21.0,185.000000,82.000000,Netherlands,NED,1988 Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [235]:

merged_df = pd.merge(athlets_events_clean,noc_regions_clean, on= 'NOC', how='left')

merged_df.isnull().sum()

merged_df

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,City,Sport,Event,Medal,region
0,1,A Dijiang,Male,24.0,180.000000,80.000000,China,CHN,1992 Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,China
1,2,A Lamusi,Male,23.0,170.000000,60.000000,China,CHN,2012 Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,China
2,3,Gunnar Nielsen Aaby,Male,24.0,175.351367,70.712603,Denmark,DEN,1920 Summer,Antwerpen,Football,Football Men's Football,NaN,Denmark
3,4,Edgar Lindenau Aabye,Male,34.0,175.351367,70.712603,Denmark/Sweden,DEN,1900 Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,Denmark
4,5,Christine Jacoba Aaftink,Female,21.0,185.000000,82.000000,Netherlands,NED,1988 Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,Netherlands
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
260411,135569,Andrzej ya,Male,29.0,179.000000,89.000000,Poland-1,POL,1976 Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NaN,Poland
260412,135570,Piotr ya,Male,27.0,176.000000,59.000000,Poland,POL,2014 Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NaN,Poland
260413,135570,Piotr ya,Male,27.0,176.000000,59.000000,Poland,POL,2014 Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NaN,Poland
260414,135571,Tomasz Ireneusz ya,Male,30.0,185.000000,96.000000,Poland,POL,1998 Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN,Poland
260415,135571,Tomasz Ireneusz ya,Male,34.0,185.000000,96.000000,Poland,POL,2002 Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NaN,Poland

### Analysis: 
__Answering the objectives through data analysis__

In [ ]:
#factors that influence winning a medal :
#does the athles age, gender, weight, hight effect winning?
# wich countries get the most medals. / what sports they are best in 
#medal counts across the years for the top 5 countries 


#gender in the olympics over time:
#count of each gender across decades
#sports with the highest/ lowest femal, female across decades
#womens medal across decades as the participation groew


#which regions dominate the Olympics, and how has global participation changed?
#growth of participating countries by year.
#regional dominance in certain sports 
#host country advantage (if its the host, does it win more)?

In [249]:
merged_df['Medal_Won'] = merged_df['Medal'].notna().astype(int)

merged_df.head()

#factors_winning= merged_df[]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,City,Sport,Event,Medal,region,Medal_Won
0,1,A Dijiang,Male,24.0,180.000000,80.000000,China,CHN,1992 Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,China,0
1,2,A Lamusi,Male,23.0,170.000000,60.000000,China,CHN,2012 Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,China,0
2,3,Gunnar Nielsen Aaby,Male,24.0,175.351367,70.712603,Denmark,DEN,1920 Summer,Antwerpen,Football,Football Men's Football,NaN,Denmark,0
3,4,Edgar Lindenau Aabye,Male,34.0,175.351367,70.712603,Denmark/Sweden,DEN,1900 Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,Denmark,1
4,5,Christine Jacoba Aaftink,Female,21.0,185.000000,82.000000,Netherlands,NED,1988 Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,Netherlands,0

In [ ]:
winning

---

## Summary
__Summarizing the key insights from the analysis__

**Note**: _Use Bullet Points_

    ...

## Recommendations/Conclusion
**Note**: _Use Bullet Points_

    ...